Feature: Визуализация на Папките

  Background: Отваряне на приложението
    Given Приложението е отворено

  Scenario: Преглед на всички папки на началния екран
    Then Показва се лист с всички папки

  Scenario: Преглед на специфична папка
    When Показва се лист с всички папки от категория "Хапване"
    Then Папката "Ливански рецепти" се показва с всичките си постове

  Scenario: Търсена на папка по името й
    When Потребителят въвежда "Ливански рецепти" в полето за търсене
    And Натиска бутона за търсене
    Then Показва се лист от папки, отговарящи на "Ливански рецепти"

  Scenario: Филтриране на папки по категория
    When Потребителят избира категория "Животни"
    Then Показва се лист от папки от категорията

  Scenario Outline: Търсене на папки по ключови думи
    When Потребителят въвежда ключова дума <keyword> в полето за търсене
    And Натиска бутона за търсене
    Then Показва се лист от папки, отговарящи на <keyword>
    Examples:
      | keyword         |
      | "Партита"       |
      | "Декор за дома" |