Feature: Визуализация на Папките

  Background: Отваряне на приложението
    Given Приложението е отворено

  Scenario: Преглед на всички папки на началния екран
    Then Показва се лист с всички папки

  Scenario: Преглед на специфична папка
    When Потребителят избира папка с име "Идеи за пътуване"
    Then Папката "Идеи за пътуване" се показва с всичките си постове

  Scenario: Търсена на папка по името й
    When Потребителят въвежда "Ливански рецепти" в полето за търсене
    And Натиска бутона за търсене
    Then Показва се лист от папки отговарящи на "Ливански рецепти"

  Scenario: Филтриране на папки по категория
    When Потребителят избира категория "Декор за дома"
    Then Показва се лист от папки от категорията "Декор за дома"

  Scenario Outline: Търсене на папки по ключови думи
    When Потребителят въвежда <ключова дума> в полето за търсене
    And Натиска бутона за търсене
    Then Показва се лист от папки, отговарящи на <ключовата дума>
    Examples:
      | ключова дума |
      | "У дома"     |
      | "чистене"    |
      | ""           |
      | "       "    |
      | "$#%$&^^(*&$"|